aws/amazon-freertos/projects/microchip/same54_xpro/mplab/aws_demos/firmware/src/packs/ATSAME54P20A_DFP/component/sdhc.h
#define SDHC_CC2R_FSDCLKD_Pos                 _U_(0)                                               /**< (SDHC_CC2R) Force SDCK Disabled Position */
#define SDHC_CC2R_FSDCLKD_Msk                 (_U_(0x1) << SDHC_CC2R_FSDCLKD_Pos)                  /**< (SDHC_CC2R) Force SDCK Disabled Mask */
#define SDHC_CC2R_FSDCLKD(value)              (SDHC_CC2R_FSDCLKD_Msk & ((value) << SDHC_CC2R_FSDCLKD_Pos))
#define   SDHC_CC2R_FSDCLKD_NOEFFECT_Val      _U_(0x0)                                             /**< (SDHC_CC2R) No effect  */
#define   SDHC_CC2R_FSDCLKD_DISABLE_Val       _U_(0x1)                                             /**< (SDHC_CC2R) SDCLK can be stopped at any time after DATA transfer.SDCLK enable forcing for 8 SDCLK cycles is disabled  */
#define SDHC_CC2R_FSDCLKD_NOEFFECT            (SDHC_CC2R_FSDCLKD_NOEFFECT_Val << SDHC_CC2R_FSDCLKD_Pos) /**< (SDHC_CC2R) No effect Position  */
#define SDHC_CC2R_FSDCLKD_DISABLE             (SDHC_CC2R_FSDCLKD_DISABLE_Val << SDHC_CC2R_FSDCLKD_Pos) /**< (SDHC_CC2R) SDCLK can be stopped at any time after DATA transfer.SDCLK enable forcing for 8 SDCLK cycles is disabled Position  */
#define SDHC_CC2R_Msk                         _U_(0x00000001)                                      /**< (SDHC_CC2R) Register Mask  */


/* -------- SDHC_CACR : (SDHC Offset: 0x230) (R/W 32) Capabilities Control -------- */
#define SDHC_CACR_RESETVALUE                  _U_(0x00)                                            /**<  (SDHC_CACR) Capabilities Control  Reset Value */

#define SDHC_CACR_CAPWREN_Pos                 _U_(0)                                               /**< (SDHC_CACR) Capabilities Registers Write Enable (Required to write the correct frequencies in the Capabilities Registers) Position */
#define SDHC_CACR_CAPWREN_Msk                 (_U_(0x1) << SDHC_CACR_CAPWREN_Pos)                  /**< (SDHC_CACR) Capabilities Registers Write Enable (Required to write the correct frequencies in the Capabilities Registers) Mask */
#define SDHC_CACR_CAPWREN(value)              (SDHC_CACR_CAPWREN_Msk & ((value) << SDHC_CACR_CAPWREN_Pos))
#define SDHC_CACR_KEY_Pos                     _U_(8)                                               /**< (SDHC_CACR) Key (0x46) Position */
#define SDHC_CACR_KEY_Msk                     (_U_(0xFF) << SDHC_CACR_KEY_Pos)                     /**< (SDHC_CACR) Key (0x46) Mask */
#define SDHC_CACR_KEY(value)                  (SDHC_CACR_KEY_Msk & ((value) << SDHC_CACR_KEY_Pos))
#define SDHC_CACR_Msk                         _U_(0x0000FF01)                                      /**< (SDHC_CACR) Register Mask  */


/* -------- SDHC_DBGR : (SDHC Offset: 0x234) (R/W 8) Debug -------- */
#define SDHC_DBGR_RESETVALUE                  _U_(0x00)                                            /**<  (SDHC_DBGR) Debug  Reset Value */

#define SDHC_DBGR_NIDBG_Pos                   _U_(0)                                               /**< (SDHC_DBGR) Non-intrusive debug enable Position */
#define SDHC_DBGR_NIDBG_Msk                   (_U_(0x1) << SDHC_DBGR_NIDBG_Pos)                    /**< (SDHC_DBGR) Non-intrusive debug enable Mask */
#define SDHC_DBGR_NIDBG(value)                (SDHC_DBGR_NIDBG_Msk & ((value) << SDHC_DBGR_NIDBG_Pos))
#define   SDHC_DBGR_NIDBG_IDBG_Val            _U_(0x0)                                             /**< (SDHC_DBGR) Debugging is intrusive (reads of BDPR from debugger are considered and increment the internal buffer pointer)  */
#define   SDHC_DBGR_NIDBG_NIDBG_Val           _U_(0x1)                                             /**< (SDHC_DBGR) Debugging is not intrusive (reads of BDPR from debugger are discarded and do not increment the internal buffer pointer)  */
#define SDHC_DBGR_NIDBG_IDBG                  (SDHC_DBGR_NIDBG_IDBG_Val << SDHC_DBGR_NIDBG_Pos)    /**< (SDHC_DBGR) Debugging is intrusive (reads of BDPR from debugger are considered and increment the internal buffer pointer) Position  */
#define SDHC_DBGR_NIDBG_NIDBG                 (SDHC_DBGR_NIDBG_NIDBG_Val << SDHC_DBGR_NIDBG_Pos)   /**< (SDHC_DBGR) Debugging is not intrusive (reads of BDPR from debugger are discarded and do not increment the internal buffer pointer) Position  */
#define SDHC_DBGR_Msk                         _U_(0x01)                                            /**< (SDHC_DBGR) Register Mask  */


/** \brief SDHC register offsets definitions */
#define SDHC_SSAR_REG_OFST             (0x00)              /**< (SDHC_SSAR) SDMA System Address / Argument 2 Offset */
#define SDHC_BSR_REG_OFST              (0x04)              /**< (SDHC_BSR) Block Size Offset */
#define SDHC_BCR_REG_OFST              (0x06)              /**< (SDHC_BCR) Block Count Offset */
#define SDHC_ARG1R_REG_OFST            (0x08)              /**< (SDHC_ARG1R) Argument 1 Offset */
#define SDHC_TMR_REG_OFST              (0x0C)              /**< (SDHC_TMR) Transfer Mode Offset */
#define SDHC_CR_REG_OFST               (0x0E)              /**< (SDHC_CR) Command Offset */
#define SDHC_RR_REG_OFST               (0x10)              /**< (SDHC_RR) Response Offset */
#define SDHC_BDPR_REG_OFST             (0x20)              /**< (SDHC_BDPR) Buffer Data Port Offset */
#define SDHC_PSR_REG_OFST              (0x24)              /**< (SDHC_PSR) Present State Offset */
#define SDHC_HC1R_REG_OFST             (0x28)              /**< (SDHC_HC1R) Host Control 1 Offset */
#define SDHC_PCR_REG_OFST              (0x29)              /**< (SDHC_PCR) Power Control Offset */
#define SDHC_BGCR_REG_OFST             (0x2A)              /**< (SDHC_BGCR) Block Gap Control Offset */
#define SDHC_WCR_REG_OFST              (0x2B)              /**< (SDHC_WCR) Wakeup Control Offset */
#define SDHC_CCR_REG_OFST              (0x2C)              /**< (SDHC_CCR) Clock Control Offset */
#define SDHC_TCR_REG_OFST              (0x2E)              /**< (SDHC_TCR) Timeout Control Offset */
#define SDHC_SRR_REG_OFST              (0x2F)              /**< (SDHC_SRR) Software Reset Offset */
#define SDHC_NISTR_REG_OFST            (0x30)              /**< (SDHC_NISTR) Normal Interrupt Status Offset */
#define SDHC_EISTR_REG_OFST            (0x32)              /**< (SDHC_EISTR) Error Interrupt Status Offset */
#define SDHC_NISTER_REG_OFST           (0x34)              /**< (SDHC_NISTER) Normal Interrupt Status Enable Offset */
#define SDHC_EISTER_REG_OFST           (0x36)              /**< (SDHC_EISTER) Error Interrupt Status Enable Offset */
#define SDHC_NISIER_REG_OFST           (0x38)              /**< (SDHC_NISIER) Normal Interrupt Signal Enable Offset */
#define SDHC_EISIER_REG_OFST           (0x3A)              /**< (SDHC_EISIER) Error Interrupt Signal Enable Offset */
#define SDHC_ACESR_REG_OFST            (0x3C)              /**< (SDHC_ACESR) Auto CMD Error Status Offset */
#define SDHC_HC2R_REG_OFST             (0x3E)              /**< (SDHC_HC2R) Host Control 2 Offset */
#define SDHC_CA0R_REG_OFST             (0x40)              /**< (SDHC_CA0R) Capabilities 0 Offset */
#define SDHC_CA1R_REG_OFST             (0x44)              /**< (SDHC_CA1R) Capabilities 1 Offset */
#define SDHC_MCCAR_REG_OFST            (0x48)              /**< (SDHC_MCCAR) Maximum Current Capabilities Offset */
#define SDHC_FERACES_REG_OFST          (0x50)              /**< (SDHC_FERACES) Force Event for Auto CMD Error Status Offset */
#define SDHC_FEREIS_REG_OFST           (0x52)              /**< (SDHC_FEREIS) Force Event for Error Interrupt Status Offset */
#define SDHC_AESR_REG_OFST             (0x54)              /**< (SDHC_AESR) ADMA Error Status Offset */
#define SDHC_ASAR_REG_OFST             (0x58)              /**< (SDHC_ASAR) ADMA System Address n Offset */
#define SDHC_PVR_REG_OFST              (0x60)              /**< (SDHC_PVR) Preset Value n Offset */
#define SDHC_SISR_REG_OFST             (0xFC)              /**< (SDHC_SISR) Slot Interrupt Status Offset */
#define SDHC_HCVR_REG_OFST             (0xFE)              /**< (SDHC_HCVR) Host Controller Version Offset */
#define SDHC_MC1R_REG_OFST             (0x204)             /**< (SDHC_MC1R) MMC Control 1 Offset */
#define SDHC_MC2R_REG_OFST             (0x205)             /**< (SDHC_MC2R) MMC Control 2 Offset */
#define SDHC_ACR_REG_OFST              (0x208)             /**< (SDHC_ACR) AHB Control Offset */
#define SDHC_CC2R_REG_OFST             (0x20C)             /**< (SDHC_CC2R) Clock Control 2 Offset */
#define SDHC_CACR_REG_OFST             (0x230)             /**< (SDHC_CACR) Capabilities Control Offset */
#define SDHC_DBGR_REG_OFST             (0x234)             /**< (SDHC_DBGR) Debug Offset */

